logs/gpburn_measured/gpuburn50/fio__2025-08-14_15-35-26.log
disk_load_20percent: (g=0): rw=randrw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
...
fio-3.19
Starting 8 processes

disk_load_20percent: (groupid=0, jobs=8): err= 0: pid=88145: Thu Aug 14 15:35:57 2025
  read: IOPS=240, BW=30.0MiB/s (31.5MB/s)(901MiB/30014msec)
    slat (usec): min=3, max=161, avg= 6.27, stdev= 3.52
    clat (usec): min=39, max=78190, avg=6917.18, stdev=4340.21
     lat (usec): min=43, max=78200, avg=6923.57, stdev=4340.21
    clat percentiles (usec):
     |  1.00th=[  204],  5.00th=[ 1893], 10.00th=[ 2573], 20.00th=[ 3654],
     | 30.00th=[ 4686], 40.00th=[ 5473], 50.00th=[ 6259], 60.00th=[ 6980],
     | 70.00th=[ 8160], 80.00th=[ 9634], 90.00th=[11731], 95.00th=[13698],
     | 99.00th=[20055], 99.50th=[26870], 99.90th=[41681], 99.95th=[57410],
     | 99.99th=[78119]
   bw (  KiB/s): min=28672, max=32768, per=100.00%, avg=30762.59, stdev=76.55, samples=472
   iops        : min=  224, max=  256, avg=240.31, stdev= 0.60, samples=472
  write: IOPS=239, BW=29.0MiB/s (31.5MB/s)(900MiB/30014msec); 0 zone resets
    slat (usec): min=4, max=854, avg= 9.15, stdev=12.31
    clat (usec): min=213, max=62005, avg=824.73, stdev=2927.52
     lat (usec): min=219, max=62017, avg=834.17, stdev=2927.81
    clat percentiles (usec):
     |  1.00th=[  229],  5.00th=[  239], 10.00th=[  245], 20.00th=[  253],
     | 30.00th=[  260], 40.00th=[  273], 50.00th=[  306], 60.00th=[  379],
     | 70.00th=[  523], 80.00th=[  693], 90.00th=[ 1074], 95.00th=[ 2040],
     | 99.00th=[ 7570], 99.50th=[19268], 99.90th=[52691], 99.95th=[55837],
     | 99.99th=[62129]
   bw (  KiB/s): min=28672, max=32768, per=100.00%, avg=30757.29, stdev=88.62, samples=472
   iops        : min=  224, max=  256, avg=240.27, stdev= 0.69, samples=472
  lat (usec)   : 50=0.06%, 100=0.24%, 250=8.40%, 500=25.71%, 750=7.08%
  lat (usec)   : 1000=3.25%
  lat (msec)   : 2=5.66%, 4=9.83%, 10=30.59%, 20=8.43%, 50=0.65%
  lat (msec)   : 100=0.10%
  cpu          : usr=0.04%, sys=0.05%, ctx=35951, majf=0, minf=142
  IO depths    : 1=99.2%, 2=0.1%, 4=0.2%, 8=0.4%, 16=0.1%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7205,7203,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=30.0MiB/s (31.5MB/s), 30.0MiB/s-30.0MiB/s (31.5MB/s-31.5MB/s), io=901MiB (944MB), run=30014-30014msec
  WRITE: bw=29.0MiB/s (31.5MB/s), 29.0MiB/s-29.0MiB/s (31.5MB/s-31.5MB/s), io=900MiB (944MB), run=30014-30014msec

Disk stats (read/write):
  sda: ios=7184/7194, merge=0/2, ticks=49668/5855, in_queue=55523, util=32.41%